; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-12)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room4)
(at ball11 room5)
(at ball12 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room4)
(at ball8 room4)
(at ball9 room5)
(at ball10 room6)
(at ball11 room6)
(at ball12 room6)
)
)
)

; plan
1. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 0 of 12
2. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 0 of 12
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 12
4. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 1 of 12
5. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 1 of 12
6. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 2 of 12
7. (pick ball9 room3 right)
   deleted: (at ball9 room3) (free right)
   added: (carry ball9 right)
   goals met: 2 of 12
8. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 2 of 12
9. (drop ball9 room5 right)
   deleted: (carry ball9 right)
   added: (at ball9 room5) (free right)
   goals met: 3 of 12
10. (pick ball12 room5 left)
   deleted: (at ball12 room5) (free left)
   added: (carry ball12 left)
   goals met: 3 of 12
11. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 3 of 12
12. (drop ball12 room6 left)
   deleted: (carry ball12 left)
   added: (at ball12 room6) (free left)
   goals met: 4 of 12
13. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 4 of 12
14. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 4 of 12
15. (pick ball7 roomb right)
   deleted: (at ball7 roomb) (free right)
   added: (carry ball7 right)
   goals met: 4 of 12
16. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 4 of 12
17. (drop ball7 room4 right)
   deleted: (carry ball7 right)
   added: (at ball7 room4) (free right)
   goals met: 5 of 12
18. (drop ball8 room4 left)
   deleted: (carry ball8 left)
   added: (at ball8 room4) (free left)
   goals met: 6 of 12
19. (pick ball10 room4 left)
   deleted: (at ball10 room4) (free left)
   added: (carry ball10 left)
   goals met: 6 of 12
20. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 6 of 12
21. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 6 of 12
22. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 6 of 12
23. (drop ball10 room6 left)
   deleted: (carry ball10 left)
   added: (at ball10 room6) (free left)
   goals met: 7 of 12
24. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 7 of 12
25. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 8 of 12
26. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 12
27. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 8 of 12
28. (pick ball11 room5 left)
   deleted: (at ball11 room5) (free left)
   added: (carry ball11 left)
   goals met: 8 of 12
29. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 8 of 12
30. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 8 of 12
31. (drop ball11 room6 left)
   deleted: (carry ball11 left)
   added: (at ball11 room6) (free left)
   goals met: 9 of 12
32. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 9 of 12
33. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 12
34. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 9 of 12
35. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 9 of 12
36. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 12
37. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 10 of 12
38. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 11 of 12
39. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 12
40. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 11 of 12
41. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 12
42. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 12 of 12
